<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of HipChat and imports into Munki.

This recipe is deprecated and will be removed in the future. Please use the recipe with this identifier instead: com.github.arubdesu.munki.HipChat</string>
	<key>Identifier</key>
	<string>com.github.derak.munki.HipChat</string>
	<key>Input</key>
	<dict/>
	<key>ParentRecipe</key>
	<string>com.github.arubdesu.munki.HipChat</string>
	<key>Process</key>
	<array/>
</dict>
</plist>
